{
  "backend/main.mo": "Canister implementing skill badge issuance, user profiles, and public badge verification with admin‑restricted minting.",
  "feature_evidence.json": "Metadata linking app features to source files, components, and requirements for traceability.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all frontend source files for build planning.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color tokens, theming variables, and dark‑mode overrides.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router, global providers, and routes for home, portfolio, badge detail, verification, and mint pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "UI card shown when users without issuer permissions try to access the mint page.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button handling auth state, loading, and React Query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal requiring first‑time authenticated users to create a profile before using the app.",
  "frontend/src/components/badges/BadgeCard.tsx": "Badge preview card showing skill info, visuals, verified status, and navigation to badge details.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component showing logo, navigation links, and a user dropdown based on authentication state.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, routed content outlet, footer, and profile setup modal.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to the current identity, refetching dependent queries on change.",
  "frontend/src/hooks/useBadges.ts": "Provides queries for fetching the caller’s badges and verifying a badge by ID.",
  "frontend/src/hooks/useCurrentUser.ts": "Hooks for fetching, saving, and checking admin status of the current user's profile.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity authentication and session state.",
  "frontend/src/hooks/useIssueBadge.ts": "Mutation hook to issue a new badge and invalidate relevant badge queries.",
  "frontend/src/hooks/useVerifyBadge.ts": "Mutation hook to verify a badge by ID using the backend actor.",
  "frontend/src/index.css": "Tailwind setup and custom CSS variables defining light/dark theme colors and typography.",
  "frontend/src/main.tsx": "App bootstrap wiring React, Internet Identity provider, React Query, and global styles.",
  "frontend/src/pages/BadgeDetailPage.tsx": "Page displaying detailed badge information with verification, share, and navigation options.",
  "frontend/src/pages/EmployerVerificationPage.tsx": "Provides a UI for employers to input or auto-load a badge ID and verify it via blockchain, showing success or error states.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying platform features and navigation options based on authentication status.",
  "frontend/src/pages/IssuerMintPage.tsx": "Allows authorized admins to mint new skill badges by submitting student principal and badge details, with validation and success feedback.",
  "frontend/src/pages/StudentPortfolioPage.tsx": "Displays a signed-in student's badge portfolio with loading, empty, and populated states.",
  "frontend/src/utils/format.ts": "Utility functions for formatting timestamps, principals, and badge IDs for display.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugins for the UI.",
  "project_state.json": "Contains project metadata, architectural notes, image requirements, and a list of existing features for a blockchain‑based skill badge marketplace. Defines versions, roles, and UI/verification workflows."
}